package homework2;

/**
 * Напишите программу вывода всех четных чисел от 2 до 100
 * Включительно
 */
public class Task2_6 {
    public static void main(String[] args) {
        for (int i = 2; i <= 100; i = i + 2) {
            System.out.println(i);
        }
    }
}
